# Задача No31. Решение в группах
# Последовательностью Фибоначчи называется последовательность чисел a0, a1, an,
#  где a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1). Требуется найти N-е число 
# Фибоначчи
# Input: 7 Output: 21

N = int(input('Введите число N: '))

# Инициализируем начальные значения
fibonacci_sequence = [0, 1]

# Находим N-ое число Фибоначчи, выполняем цикл, пока длина последовательности 
# не достигнет N+1, 
# находим следующие числа и добавляем найденное число в последовательность
for i in range(2, N + 1):
    next_number = fibonacci_sequence[-1] + fibonacci_sequence[-2]
    fibonacci_sequence.append(next_number)
   

# В результат записываем N число и выводим 
result = fibonacci_sequence[N]

print(f"N-е число Фибоначчи: {result}")
