# Дополнить телефонный справочник возможностью изменения и удаления данных.
# Пользователь также может ввести имя или фамилию, и Вы должны реализовать
#  функционал
# для изменения и удаления данных.


# 1.Создание файла:
#     - открываем файл на дозапись #a
# 2.Добавление контакта
#     - запросить у пользователя новый контакта
#     - открыть файл на дозапись #a
#     - добавить новый контакт
# 3.Вывод данных на экран:
#     -открыть файл на чтение #r
#     - считать файл
#     - вывести на экран
# 4.Поиск контакта:
#     - выбор варианта поиска
#     - запросить данные для поиска
#     - открыть файл на чтение
#     - считываем данные, сохранить их в переменную
#     - осуществляем поиск контакта
#     - вывести на экран
# 5. Создание UI:
#     - вывести меню на экран
#     - запросить у пользователя вариант действия
#     - запустить соответствующую функцию 
#     - осуществить возможность выхода из программы

